{"sailingYears":[{"hasMoreDates":false,"year":2017,"itineraryId":0,"sailingMonths":[{"month":3,"isLowestPrice":true,"sailingDates":[{"date":28,"bookable":false,"outsideCabinAvailability":"Available","productId":0,"isLowestPrice":true,"balconyCabinAvailability":"Not Offered","returnDayOfWeek":"Tuesday","suiteCabinPrice":2999,"departureTimeInMillis":1490659200000,"sailingId":"V720","insideCabinPrice":999,"duration":14,"returnDate":"Apr. 11, 2017","insideCabinAvailability":"Available","promotions":[{"promotionLinks":[],"promotionName":"Expedia+ Rewards Points","cruiseCardPromotionName":"Earn Expedia+ Rewards Points!","campaignId":0,"promotionCode":"1070358870","rank":20,"fullDescription":"Now you can Earn Expedia+ rewards points on cruises! Expedia+ rewards members earn 2 Expedia+ rewards points per $1 for cruises. To receive points for your cruise, you must be an Expedia+ rewards member and use the same email address associated to your enrolled Expedia Account at the time of booking or enroll in Expedia+ rewards using the same email address used to book your cruise any time after purchase has been made, but prior to sailing start date. Restrictions may apply; please see full terms and conditions for complete details.","promotionId":0,"termsAndConditions":"Expedia Rewards members who book a cruise on Expedia.com and with Expedia customer service agents through our call centers can earn 2 Expedia+ rewards Points per $1 USD spent. Rewards points will be awarded for the total transaction amount including cruise fare, government fees and taxes for all guests in the cabin. It does not include other charges such as insurance, prepaid gratuities, or other similar charges or fees. To receive points for your cruise, you must be an Expedia+ rewards member and use the same email address associated to your enrolled Expedia Account at the time of booking or enroll in Expedia+ rewards using the same email address used to book your cruise any time after purchase has been made, but prior to sailing start date. Your Expedia account email can be found in the Account Overview section of your Expedia Account. Points earned for cruise purchases will not appear as pending on your Expedia+ rewards Activity Page; they will post to your account 4-6 weeks after travel is complete, and will appear as bonus points on your statement."}],"departureDayOfWeek":"Tuesday","oceanViewCabinPrice":1099,"departureDate":"Mar. 28, 2017","suiteCabinAvailability":"Available","balconyCabinPrice":0,"basePrice":999}]}]}],"sponsoredListingDataString":"PMI.CRU-SR-SPON-DPANY-Asia-WK201703","disclaimerMessage":""}
